// 导入解混淆的包
const _ᕺᖄᖃᖚ = require('./decongestion-v1.9.7.js')._ᕺᖄᖃᖚ

typeof window == "undefined" ? window = global : null;
!function(e) {
    var n = {}
    function u(r) {
        if (n[r]){
            console.log(`加载缓存模块 --> ${r}`)
            return n[r].exports;
        }
        var t = n[r] = {
            i: r,
            l: !1,
            exports: {}
        }
          , o = !0;
        try {
            console.log(`加载的模块是 --> ${typeof r} ---> ${r}`, r in e ? '已加载' : '缺少模块')
            e[r].call(t.exports, t, t.exports, u),
            o = !1
        } finally {
            o && delete n[r]
        }
        return t.l = !0,
        t.exports
    }
    jzq = u;
}({
    0: function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
        var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
            , _ᖀᖚᖄᖙ = ["$_FFFEK"].concat(_ᖀᕷᖂᖚ)
            , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
        _ᖀᖚᖄᖙ.shift();
        var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
        _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(0)] = !0,
        _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(68)] = void 0;
        var _ᕵᖈᖆᖈ = _ᕵᕴᖆᖆ(0)
            , _ᖀᖈᖂᖙ = {
            start: 0,
            move: 1,
            end: 2,
            down: 3
        }
            , _ᕿᖄᖙᕴ = {
            unknown: 0,
            mouse: 1,
            touch: 2,
            pen: 3
        }
            , _ᕿᖗᖗᕵ = {
            hash: _ᖀᕷᖂᖚ(39),
            minDistance: 2,
            stillInterval: 80,
            sampleInterval: 1e3 / 60,
            percentPrecision: 4,
            maxPoints: 150,
            keepBeforeClick: 150,
            now: _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(121)]
        };
        function u() {
            var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖂᖀᖈᕷ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                switch (_ᖂᖀᖈᕷ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    var e = function _ᖂᖀᖈᕷ() {
                        var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᕵᕴᖆᖆ = ["$_FFFJO"].concat(_ᖈᖈᖄᖙ)
                            , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                        _ᕵᕴᖆᖆ.shift();
                        var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                        return _ᖈᖈᖄᖙ(8) == typeof window ? {} : window
                    }();
                    return e[_ᖀᕷᖂᖚ(1422)] || e[_ᖄᖘᕺᖚ(1426)] ? _ᖄᖘᕺᖚ(1468) : _ᖄᖘᕺᖚ(1406) in e ? _ᖄᖘᕺᖚ(1432) : _ᖄᖘᕺᖚ(1467);
                    break
                }
            }
        }
        function _(_ᖂᖀᖈᕷ) {
            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                switch (_ᖈᖈᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    return _ᖂᖀᖈᕷ && _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(246)] ? _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(246)] : _ᖂᖀᖈᕷ;
                    break
                }
            }
        }
        function h(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    var n = _(_ᖂᖀᖈᕷ)
                        , s = n && function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                        var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᖀᕷᖂᖚ = ["$_FFGEW"].concat(_ᕵᕴᖆᖆ)
                            , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                        _ᖀᕷᖂᖚ.shift();
                        var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                        if (2 === _ᖈᖈᖄᖙ)
                            return _ᕿᖄᖙᕴ[_ᕵᕴᖆᖆ(1432)];
                        if (3 === _ᖈᖈᖄᖙ)
                            return _ᕿᖄᖙᕴ[_ᕵᕴᖆᖆ(1442)];
                        if (4 === _ᖈᖈᖄᖙ)
                            return _ᕿᖄᖙᕴ[_ᕵᕴᖆᖆ(1467)];
                        if (_ᖀᖚᖄᖙ(23) == typeof _ᖈᖈᖄᖙ) {
                            var t = _ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(48)]();
                            if (Object[_ᖀᖚᖄᖙ(35)][_ᕵᕴᖆᖆ(70)][_ᕵᕴᖆᖆ(33)](_ᕿᖄᖙᕴ, t))
                                return _ᕿᖄᖙᕴ[t]
                        }
                        return _ᕿᖄᖙᕴ[_ᕵᕴᖆᖆ(571)]
                    }(n[_ᖄᖘᕺᖚ(1491)]);
                    return s || (n && (n[_ᖄᖘᕺᖚ(235)] && n[_ᖀᕷᖂᖚ(235)][_ᖄᖘᕺᖚ(112)] || n[_ᖀᕷᖂᖚ(1455)] && n[_ᖀᕷᖂᖚ(1455)][_ᖀᕷᖂᖚ(112)]) ? _ᕿᖄᖙᕴ[_ᖄᖘᕺᖚ(1432)] : n && n[_ᖄᖘᕺᖚ(341)] && /^touch/[_ᖀᕷᖂᖚ(169)](n[_ᖀᕷᖂᖚ(341)]) ? _ᕿᖄᖙᕴ[_ᖀᕷᖂᖚ(1432)] : n && n[_ᖄᖘᕺᖚ(341)] && /^mouse/[_ᖀᕷᖂᖚ(169)](n[_ᖄᖘᕺᖚ(341)]) ? _ᕿᖄᖙᕴ[_ᖀᕷᖂᖚ(1467)] : _ᖀᕷᖂᖚ(1432) === _ᖈᖈᖄᖙ ? _ᕿᖄᖙᕴ[_ᖀᕷᖂᖚ(1432)] : _ᖄᖘᕺᖚ(1467) === _ᖈᖈᖄᖙ ? _ᕿᖄᖙᕴ[_ᖀᕷᖂᖚ(1467)] : _ᕿᖄᖙᕴ[_ᖄᖘᕺᖚ(571)]);
                    break
                }
            }
        }
        function c(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                    return -1 < function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                        var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᖀᕷᖂᖚ = ["$_FFGJK"].concat(_ᕵᕴᖆᖆ)
                            , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                        _ᖀᕷᖂᖚ.shift();
                        var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                        return _ᖈᖈᖄᖙ ? _ᕵᕴᖆᖆ(23) == typeof _ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(262)] ? _ᖈᖈᖄᖙ[_ᖀᖚᖄᖙ(262)] : _ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(854)] && _ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(854)](_ᖀᖚᖄᖙ(1474)) || _ᖀᖚᖄᖙ(39) : _ᖀᖚᖄᖙ(39)
                    }(_ᖂᖀᖈᕷ)[_ᖄᖘᕺᖚ(111)](/\s+/)[_ᖀᕷᖂᖚ(29)](_ᖈᖈᖄᖙ);
                    break
                }
            }
        }
        function l(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[8][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    if (!_ᖂᖀᖈᕷ || !_ᖈᖈᖄᖙ)
                        return null;
                    if (c(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ))
                        return _ᖂᖀᖈᕷ;
                    for (var n = _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(260)] || _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(1454)] || [], s = 0; s < n[_ᖀᕷᖂᖚ(112)]; s += 1) {
                        var i = l(n[s], _ᖈᖈᖄᖙ);
                        if (i)
                            return i
                    }
                    return null;
                    break
                }
            }
        }
        function _ᖄᕷᕴᖁ(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    this[_ᖀᕷᖂᖚ(1486)] = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                        var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᖀᕷᖂᖚ = ["$_FFHEs"].concat(_ᕵᕴᖆᖆ)
                            , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                        _ᖀᕷᖂᖚ.shift();
                        var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                        return _ᖈᖈᖄᖙ && _ᖈᖈᖄᖙ[_ᖀᖚᖄᖙ(275)] ? _ᖈᖈᖄᖙ[_ᖀᖚᖄᖙ(275)] : _ᖈᖈᖄᖙ
                    }(_ᖂᖀᖈᕷ),
                    this[_ᖀᕷᖂᖚ(517)] = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                        var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᖀᕷᖂᖚ = ["$_FFHJt"].concat(_ᕵᕴᖆᖆ)
                            , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                        _ᖀᕷᖂᖚ.shift();
                        var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                        var _ᕾᖀᕸᕴ = {}
                            , _ᕵᖈᖆᖈ = _ᖈᖈᖄᖙ || {};
                        return Object[_ᖀᖚᖄᖙ(839)](_ᕿᖗᖗᕵ)[_ᖀᖚᖄᖙ(197)](function(_ᖂᖀᖈᕷ) {
                            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                                , _ᕵᕴᖆᖆ = ["$_FFIE_"].concat(_ᖈᖈᖄᖙ)
                                , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                            _ᕵᕴᖆᖆ.shift();
                            var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                            _ᕾᖀᕸᕴ[_ᖂᖀᖈᕷ] = Object[_ᖀᕷᖂᖚ(35)][_ᖀᕷᖂᖚ(70)][_ᖈᖈᖄᖙ(33)](_ᕵᖈᖆᖈ, _ᖂᖀᖈᕷ) ? _ᕵᖈᖆᖈ[_ᖂᖀᖈᕷ] : _ᕿᖗᖗᕵ[_ᖂᖀᖈᕷ]
                        }),
                        _ᕾᖀᕸᕴ
                    }(_ᖈᖈᖄᖙ),
                    this[_ᖄᖘᕺᖚ(1488)] = null,
                    this[_ᖀᕷᖂᖚ(1010)] = u(),
                    this[_ᖀᕷᖂᖚ(946)] = _ᕿᖄᖙᕴ[_ᖀᕷᖂᖚ(571)],
                    this[_ᖀᕷᖂᖚ(1473)] = [],
                    this[_ᖄᖘᕺᖚ(1477)] = 0,
                    this[_ᖄᖘᕺᖚ(1451)] = 0,
                    this[_ᖄᖘᕺᖚ(1496)] = 0,
                    this[_ᖄᖘᕺᖚ(1435)] = 0,
                    this[_ᖀᕷᖂᖚ(1498)] = !1,
                    this[_ᖀᕷᖂᖚ(1452)] = [],
                    this[_ᖀᕷᖂᖚ(1478)] = !1;
                    _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[4][13];
                    break
                }
            }
        }
        _ᖄᕷᕴᖁ[_ᖀᕷᖂᖚ(35)] = {
            bind: function() {
                var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖈᖈᖄᖙ = ["$_FFIJd"].concat(_ᖂᖀᖈᕷ)
                    , _ᕵᕴᖆᖆ = _ᖈᖈᖄᖙ[1];
                _ᖈᖈᖄᖙ.shift();
                var _ᖀᕷᖂᖚ = _ᖈᖈᖄᖙ[0];
                function _ᖀᖈᖂᖙ(_ᖂᖀᖈᕷ) {
                    var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
                    for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                        switch (_ᖈᖈᖄᖙ) {
                        case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                            t[_ᕵᕴᖆᖆ(1483)](_ᖂᖀᖈᕷ, _ᕵᕴᖆᖆ(1424));
                            _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][13];
                            break
                        }
                    }
                }
                function _ᕵᖈᖆᖈ(_ᖂᖀᖈᕷ) {
                    var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
                    for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[8][13]; ) {
                        switch (_ᖈᖈᖄᖙ) {
                        case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                            t[_ᕵᕴᖆᖆ(1483)](_ᖂᖀᖈᕷ, _ᕵᕴᖆᖆ(1424));
                            _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][13];
                            break
                        }
                    }
                }
                function _ᕾᖀᕸᕴ(_ᖂᖀᖈᕷ) {
                    var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[8][14];
                    for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                        switch (_ᖈᖈᖄᖙ) {
                        case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                            t[_ᕵᕴᖆᖆ(1483)](_ᖂᖀᖈᕷ, _ᕵᕴᖆᖆ(1487));
                            _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[8][13];
                            break
                        }
                    }
                }
                function _ᖄᖘᕺᖚ(_ᖂᖀᖈᕷ) {
                    var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[8][14];
                    for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                        switch (_ᖈᖈᖄᖙ) {
                        case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                            t[_ᕵᕴᖆᖆ(1483)](_ᖂᖀᖈᕷ, _ᕵᕴᖆᖆ(1407));
                            _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[8][13];
                            break
                        }
                    }
                }
                var t = this
                    , e = t[_ᕵᕴᖆᖆ(1486)];
                if (!e || !e[_ᖂᖀᖈᕷ(241)] || t[_ᖂᖀᖈᕷ(1478)])
                    return t;
                var _ᖀᖚᖄᖙ = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                    var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                        , _ᖀᕷᖂᖚ = ["$_FFJEM"].concat(_ᕵᕴᖆᖆ)
                        , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                    _ᖀᕷᖂᖚ.shift();
                    var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                    return _ᕵᕴᖆᖆ(1468) === _ᖈᖈᖄᖙ ? {
                        start: [_ᖀᖚᖄᖙ(222), _ᖀᖚᖄᖙ(228)],
                        move: [_ᖀᖚᖄᖙ(229), _ᕵᕴᖆᖆ(240)],
                        end: [_ᖀᖚᖄᖙ(284), _ᖀᖚᖄᖙ(202)],
                        cancel: [_ᕵᕴᖆᖆ(1418), _ᕵᕴᖆᖆ(1438)]
                    } : _ᖀᖚᖄᖙ(1432) === _ᖈᖈᖄᖙ ? {
                        start: [_ᖀᖚᖄᖙ(264)],
                        move: [_ᖀᖚᖄᖙ(259)],
                        end: [_ᕵᕴᖆᖆ(288)],
                        cancel: [_ᕵᕴᖆᖆ(281)]
                    } : {
                        start: [_ᖀᖚᖄᖙ(230)],
                        move: [_ᖀᖚᖄᖙ(245)],
                        end: [_ᕵᕴᖆᖆ(203)],
                        cancel: []
                    }
                }(t[_ᖂᖀᖈᕷ(1010)]);
                return t[_ᖂᖀᖈᕷ(1461)](_ᖀᖚᖄᖙ[_ᖂᖀᖈᕷ(1448)], _ᖄᖘᕺᖚ),
                t[_ᖂᖀᖈᕷ(1461)](_ᖀᖚᖄᖙ[_ᕵᕴᖆᖆ(1487)], _ᕾᖀᕸᕴ),
                t[_ᖂᖀᖈᕷ(1461)](_ᖀᖚᖄᖙ[_ᕵᕴᖆᖆ(1424)], _ᕵᖈᖆᖈ),
                t[_ᕵᕴᖆᖆ(1461)](_ᖀᖚᖄᖙ[_ᕵᕴᖆᖆ(1413)], _ᖀᖈᖂᖙ),
                t[_ᕵᕴᖆᖆ(1478)] = !0,
                t
            },
            unbind: function() {
                var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖈᖈᖄᖙ = ["$_FFJJE"].concat(_ᖂᖀᖈᕷ)
                    , _ᕵᕴᖆᖆ = _ᖈᖈᖄᖙ[1];
                _ᖈᖈᖄᖙ.shift();
                var _ᖀᕷᖂᖚ = _ᖈᖈᖄᖙ[0];
                var _ᖀᖚᖄᖙ = this[_ᕵᕴᖆᖆ(1486)];
                return _ᖀᖚᖄᖙ && _ᖀᖚᖄᖙ[_ᕵᕴᖆᖆ(200)] && this[_ᖂᖀᖈᕷ(1452)][_ᕵᕴᖆᖆ(197)](function(_ᖂᖀᖈᕷ) {
                    var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                        , _ᕵᕴᖆᖆ = ["$_FGAEJ"].concat(_ᖈᖈᖄᖙ)
                        , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                    _ᕵᕴᖆᖆ.shift();
                    var _ᖄᖘᕺᖚ = _ᕵᕴᖆᖆ[0];
                    _ᖀᖚᖄᖙ[_ᖈᖈᖄᖙ(200)](_ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(341)], _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(1420)])
                }),
                this[_ᖂᖀᖈᕷ(1452)] = [],
                this[_ᖂᖀᖈᕷ(1478)] = !1,
                this
            },
            reset: function() {
                var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖈᖈᖄᖙ = ["$_FGAJr"].concat(_ᖂᖀᖈᕷ)
                    , _ᕵᕴᖆᖆ = _ᖈᖈᖄᖙ[1];
                _ᖈᖈᖄᖙ.shift();
                var _ᖀᕷᖂᖚ = _ᖈᖈᖄᖙ[0];
                return this[_ᖂᖀᖈᕷ(1473)] = [],
                this[_ᕵᕴᖆᖆ(1477)] = 0,
                this[_ᖂᖀᖈᕷ(1451)] = 0,
                this[_ᖂᖀᖈᕷ(1496)] = 0,
                this[_ᕵᕴᖆᖆ(1435)] = 0,
                this[_ᖂᖀᖈᕷ(1498)] = !1,
                this[_ᖂᖀᖈᕷ(946)] = _ᕿᖄᖙᕴ[_ᕵᕴᖆᖆ(571)],
                this
            },
            finish: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGBEU"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                try {
                    return this[_ᖀᕷᖂᖚ(1425)](_ᖀᕷᖂᖚ(1424)) || this[_ᖈᖈᖄᖙ(1412)](_ᖂᖀᖈᕷ),
                    this[_ᖈᖈᖄᖙ(1437)]()
                } catch (e) {
                    return null
                }
            },
            getPayload: function() {
                var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖈᖈᖄᖙ = ["$_FGBJb"].concat(_ᖂᖀᖈᕷ)
                    , _ᕵᕴᖆᖆ = _ᖈᖈᖄᖙ[1];
                _ᖈᖈᖄᖙ.shift();
                var _ᖀᕷᖂᖚ = _ᖈᖈᖄᖙ[0];
                var t = this[_ᕵᕴᖆᖆ(1419)](this[_ᕵᕴᖆᖆ(1473)]);
                return t[_ᕵᕴᖆᖆ(112)] ? {
                    m: this[_ᕵᕴᖆᖆ(946)],
                    w: this[_ᕵᕴᖆᖆ(1477)] || 0,
                    h: this[_ᖂᖀᖈᕷ(1451)] || 0,
                    s: this[_ᖂᖀᖈᕷ(1496)] || 0,
                    e: this[_ᖂᖀᖈᕷ(1435)] || this[_ᖂᖀᖈᕷ(1496)] || 0,
                    p: this[_ᖂᖀᖈᕷ(1475)](t)
                } : null
            },
            recordEnd: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGCEZ"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                return this[_ᖈᖈᖄᖙ(1483)](_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ(1424))
            },
            recordDown: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGCJB"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                return this[_ᖀᕷᖂᖚ(1483)](_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ(1407))
            },
            recordMove: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGDEU"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                return this[_ᖀᕷᖂᖚ(1483)](_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ(1487))
            },
            $_BHED: function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
                var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖀᕷᖂᖚ = ["$_FGDJb"].concat(_ᕵᕴᖆᖆ)
                    , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                _ᖀᕷᖂᖚ.shift();
                var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                var _ᕾᖀᕸᕴ = this
                    , _ᕵᖈᖆᖈ = _ᕾᖀᕸᕴ[_ᖀᖚᖄᖙ(1486)];
                _ᖂᖀᖈᕷ[_ᕵᕴᖆᖆ(197)](function(_ᖂᖀᖈᕷ) {
                    var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                        , _ᖀᕷᖂᖚ = ["$_FGEEt"].concat(_ᕵᕴᖆᖆ)
                        , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                    _ᖀᕷᖂᖚ.shift();
                    var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                    _ᕵᖈᖆᖈ[_ᕵᕴᖆᖆ(241)](_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ),
                    _ᕾᖀᕸᕴ[_ᕵᕴᖆᖆ(1452)][_ᕵᕴᖆᖆ(160)]({
                        type: _ᖂᖀᖈᕷ,
                        handler: _ᖈᖈᖄᖙ
                    })
                })
            },
            $_BHDL: function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
                var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖀᕷᖂᖚ = ["$_FGEJx"].concat(_ᕵᕴᖆᖆ)
                    , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                _ᖀᕷᖂᖚ.shift();
                var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                try {
                    return this[_ᖀᖚᖄᖙ(1489)](_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ)
                } catch (e) {
                    return null
                }
            },
            $_BHIF: function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
                var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖀᕷᖂᖚ = ["$_FGFEE"].concat(_ᕵᕴᖆᖆ)
                    , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                _ᖀᕷᖂᖚ.shift();
                var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                var _ᕾᖀᕸᕴ = this[_ᕵᕴᖆᖆ(517)][_ᕵᕴᖆᖆ(121)]()
                    , _ᕵᖈᖆᖈ = this[_ᖀᖚᖄᖙ(1436)](_ᖂᖀᖈᕷ);
                if (!_ᕵᖈᖆᖈ)
                    return null;
                if (!_ᕵᖈᖆᖈ[_ᕵᕴᖆᖆ(946)] && this[_ᖀᖚᖄᖙ(946)] || (this[_ᖀᖚᖄᖙ(946)] = _ᕵᖈᖆᖈ[_ᕵᕴᖆᖆ(946)]),
                this[_ᖀᖚᖄᖙ(1496)] || (this[_ᖀᖚᖄᖙ(1496)] = _ᕾᖀᕸᕴ,
                this[_ᖀᖚᖄᖙ(1497)](_ᕵᖈᖆᖈ, _ᖀᖚᖄᖙ(1448), _ᕾᖀᕸᕴ)),
                _ᖀᖚᖄᖙ(1407) === _ᖈᖈᖄᖙ) {
                    if (this[_ᖀᖚᖄᖙ(1498)])
                        return this;
                    this[_ᖀᖚᖄᖙ(1498)] = !0
                }
                if (_ᖀᖚᖄᖙ(1424) === _ᖈᖈᖄᖙ) {
                    if (this[_ᕵᕴᖆᖆ(1425)](_ᖀᖚᖄᖙ(1424)))
                        return this[_ᖀᖚᖄᖙ(1435)] = _ᕾᖀᕸᕴ,
                        this[_ᖀᖚᖄᖙ(1498)] = !1,
                        this;
                    this[_ᖀᖚᖄᖙ(1435)] = _ᕾᖀᕸᕴ,
                    this[_ᕵᕴᖆᖆ(1498)] = !1
                }
                return this[_ᕵᕴᖆᖆ(1497)](_ᕵᖈᖆᖈ, _ᖈᖈᖄᖙ, _ᕾᖀᕸᕴ),
                this
            },
            $_BHFg: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGFJV"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                var _ᖄᖘᕺᖚ = this[_ᖀᕷᖂᖚ(1473)][this[_ᖀᕷᖂᖚ(1473)][_ᖈᖈᖄᖙ(112)] - 1];
                return !!_ᖄᖘᕺᖚ && _ᖄᖘᕺᖚ[_ᖀᕷᖂᖚ(341)] === _ᖂᖀᖈᕷ
            },
            $_BHJJ: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGGEl"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                var _ᖄᖘᕺᖚ = this[_ᖈᖈᖄᖙ(1428)]()
                    , _ᕾᖀᕸᕴ = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                    var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                        , _ᖀᕷᖂᖚ = ["$_FGGJv"].concat(_ᕵᕴᖆᖆ)
                        , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                    _ᖀᕷᖂᖚ.shift();
                    var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                    var _ᕾᖀᕸᕴ = _(_ᖈᖈᖄᖙ);
                    if (!_ᕾᖀᕸᕴ)
                        return null;
                    if (_ᖀᖚᖄᖙ(94) == typeof _ᖈᖈᖄᖙ[_ᖀᖚᖄᖙ(1484)] && _ᖀᖚᖄᖙ(94) == typeof _ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(1458)]) {
                        var n = _ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(1484)]()
                            , s = _ᖈᖈᖄᖙ[_ᖀᖚᖄᖙ(1458)]();
                        return n < 0 || s < 0 ? null : {
                            clientX: n,
                            clientY: s,
                            pressure: _ᕾᖀᕸᕴ[_ᕵᕴᖆᖆ(1470)]
                        }
                    }
                    if (_ᖀᖚᖄᖙ(315) == typeof _ᕾᖀᕸᕴ[_ᖀᖚᖄᖙ(282)] && _ᕵᕴᖆᖆ(315) == typeof _ᕾᖀᕸᕴ[_ᕵᕴᖆᖆ(295)])
                        return {
                            clientX: _ᕾᖀᕸᕴ[_ᕵᕴᖆᖆ(282)],
                            clientY: _ᕾᖀᕸᕴ[_ᕵᕴᖆᖆ(295)],
                            pressure: _ᕾᖀᕸᕴ[_ᕵᕴᖆᖆ(1470)]
                        };
                    var _ᕵᖈᖆᖈ = _ᕾᖀᕸᕴ[_ᖀᖚᖄᖙ(235)] && _ᕾᖀᕸᕴ[_ᖀᖚᖄᖙ(235)][0] ? _ᕾᖀᕸᕴ[_ᖀᖚᖄᖙ(235)][0] : _ᕾᖀᕸᕴ[_ᖀᖚᖄᖙ(1455)] && _ᕾᖀᕸᕴ[_ᖀᖚᖄᖙ(1455)][0];
                    return _ᕵᖈᖆᖈ ? {
                        clientX: _ᕵᖈᖆᖈ[_ᖀᖚᖄᖙ(282)],
                        clientY: _ᕵᖈᖆᖈ[_ᖀᖚᖄᖙ(295)],
                        pressure: _ᕵᖈᖆᖈ[_ᖀᖚᖄᖙ(1449)]
                    } : null
                }(_ᖂᖀᖈᕷ);
                if (!_ᖄᖘᕺᖚ || !_ᖄᖘᕺᖚ[_ᖈᖈᖄᖙ(219)] || !_ᕾᖀᕸᕴ)
                    return null;
                var s = _ᖄᖘᕺᖚ[_ᖀᕷᖂᖚ(219)]()
                    , i = Math[_ᖀᕷᖂᖚ(692)](_ᕾᖀᕸᕴ[_ᖈᖈᖄᖙ(282)] - s[_ᖈᖈᖄᖙ(1495)])
                    , _ᕵᖈᖆᖈ = Math[_ᖀᕷᖂᖚ(692)](_ᕾᖀᕸᕴ[_ᖀᕷᖂᖚ(295)] - s[_ᖀᕷᖂᖚ(1409)])
                    , _ᖀᖈᖂᖙ = s[_ᖈᖈᖄᖙ(1429)] - s[_ᖀᕷᖂᖚ(1495)]
                    , _ᕿᖄᖙᕴ = s[_ᖈᖈᖄᖙ(1471)] - s[_ᖈᖈᖄᖙ(1409)];
                if (i < 0 || _ᕵᖈᖆᖈ < 0 || _ᖀᖈᖂᖙ < i || _ᕿᖄᖙᕴ < _ᕵᖈᖆᖈ)
                    return null;
                var _ᕿᖗᖗᕵ = {
                    x: i,
                    y: _ᕵᖈᖆᖈ,
                    width: _ᖀᖈᖂᖙ,
                    height: _ᕿᖄᖙᕴ
                };
                return _ᕿᖗᖗᕵ[_ᖈᖈᖄᖙ(946)] = h(_ᖂᖀᖈᕷ, this[_ᖀᕷᖂᖚ(1010)]),
                this[_ᖀᕷᖂᖚ(1477)] = _ᕿᖗᖗᕵ[_ᖈᖈᖄᖙ(1477)],
                this[_ᖀᕷᖂᖚ(1451)] = _ᕿᖗᖗᕵ[_ᖈᖈᖄᖙ(1451)],
                _ᖈᖈᖄᖙ(315) == typeof _ᕾᖀᕸᕴ[_ᖈᖈᖄᖙ(1470)] && (_ᕿᖗᖗᕵ[_ᖈᖈᖄᖙ(1470)] = _ᕾᖀᕸᕴ[_ᖀᕷᖂᖚ(1470)]),
                _ᕿᖗᖗᕵ
            },
            $_BIBF: function() {
                var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖈᖈᖄᖙ = ["$_FGHER"].concat(_ᖂᖀᖈᕷ)
                    , _ᕵᕴᖆᖆ = _ᖈᖈᖄᖙ[1];
                _ᖈᖈᖄᖙ.shift();
                var _ᖀᕷᖂᖚ = _ᖈᖈᖄᖙ[0];
                var _ᖀᖚᖄᖙ = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
                    var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
                        , _ᖀᖚᖄᖙ = ["$_FGHJF"].concat(_ᖀᕷᖂᖚ)
                        , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
                    _ᖀᖚᖄᖙ.shift();
                    var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
                    var _ᕵᖈᖆᖈ = _ᖈᖈᖄᖙ
                        , _ᖀᖈᖂᖙ = _ᕵᕴᖆᖆ ? _ᖄᖘᕺᖚ(1411) + _ᕵᕴᖆᖆ : _ᖄᖘᕺᖚ(39);
                    while (_ᕵᖈᖆᖈ) {
                        if (_ᖀᖈᖂᖙ && c(_ᕵᖈᖆᖈ, _ᖀᖈᖂᖙ))
                            return _ᕵᖈᖆᖈ;
                        _ᕵᖈᖆᖈ = _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(213)]
                    }
                    if (_ᖀᖈᖂᖙ)
                        return l(_ᖈᖈᖄᖙ, _ᖀᖈᖂᖙ);
                    _ᕵᖈᖆᖈ = _ᖈᖈᖄᖙ;
                    while (_ᕵᖈᖆᖈ) {
                        if (c(_ᕵᖈᖆᖈ, _ᖀᕷᖂᖚ(1403)))
                            return _ᕵᖈᖆᖈ;
                        _ᕵᖈᖆᖈ = _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(213)]
                    }
                    return l(_ᖈᖈᖄᖙ, _ᖀᕷᖂᖚ(1403)) || _ᖈᖈᖄᖙ
                }(this[_ᕵᕴᖆᖆ(1486)], this[_ᕵᕴᖆᖆ(517)][_ᕵᕴᖆᖆ(387)]);
                return this[_ᖂᖀᖈᕷ(1488)] = _ᖀᖚᖄᖙ
            },
            $_BIAv: function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
                var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖀᖚᖄᖙ = ["$_FGIEV"].concat(_ᖀᕷᖂᖚ)
                    , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
                _ᖀᖚᖄᖙ.shift();
                var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
                var _ᕵᖈᖆᖈ = {
                    x: _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(163)],
                    y: _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(154)],
                    width: _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(1477)],
                    height: _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(1451)],
                    t: _ᕵᕴᖆᖆ - this[_ᖄᖘᕺᖚ(1496)],
                    type: _ᖈᖈᖄᖙ,
                    source: _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(946)]
                };
                _ᖄᖘᕺᖚ(315) == typeof _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(1470)] && (_ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(1470)] = _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(1470)]),
                this[_ᖄᖘᕺᖚ(1453)](_ᕵᖈᖆᖈ) && this[_ᖄᖘᕺᖚ(1473)][_ᖀᕷᖂᖚ(160)](_ᕵᖈᖆᖈ)
            },
            $_BICe: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGIJm"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                var _ᖄᖘᕺᖚ = this[_ᖈᖈᖄᖙ(1473)][this[_ᖈᖈᖄᖙ(1473)][_ᖈᖈᖄᖙ(112)] - 1];
                if (!_ᖄᖘᕺᖚ)
                    return !0;
                if (_ᖈᖈᖄᖙ(1487) !== _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(341)])
                    return !0;
                var _ᕾᖀᕸᕴ = _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(163)] - _ᖄᖘᕺᖚ[_ᖈᖈᖄᖙ(163)]
                    , _ᕵᖈᖆᖈ = _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(154)] - _ᖄᖘᕺᖚ[_ᖀᕷᖂᖚ(154)]
                    , _ᖀᖈᖂᖙ = _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(36)] - _ᖄᖘᕺᖚ[_ᖈᖈᖄᖙ(36)]
                    , _ᕿᖄᖙᕴ = Math[_ᖈᖈᖄᖙ(140)](_ᕾᖀᕸᕴ * _ᕾᖀᕸᕴ + _ᕵᖈᖆᖈ * _ᕵᖈᖆᖈ)
                    , _ᕿᖗᖗᕵ = this[_ᖀᕷᖂᖚ(517)][_ᖀᕷᖂᖚ(1410)];
                return !(_ᕿᖗᖗᕵ && _ᖀᖈᖂᖙ < _ᕿᖗᖗᕵ) && !(0 === _ᕿᖄᖙᕴ && _ᖀᖈᖂᖙ < this[_ᖀᕷᖂᖚ(517)][_ᖀᕷᖂᖚ(1408)]) && (_ᕿᖄᖙᕴ >= this[_ᖈᖈᖄᖙ(517)][_ᖈᖈᖄᖙ(1443)] || _ᖀᖈᖂᖙ >= this[_ᖀᕷᖂᖚ(517)][_ᖈᖈᖄᖙ(1408)])
            },
            $_BHGD: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FGJEv"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                var _ᖄᖘᕺᖚ = this[_ᖈᖈᖄᖙ(517)][_ᖈᖈᖄᖙ(1415)];
                if (!_ᖄᖘᕺᖚ || _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)] <= _ᖄᖘᕺᖚ)
                    return _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(119)]();
                for (var n = _ᖂᖀᖈᕷ[0], s = [], i = [], r = null, o = 1; o < _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(112)]; o += 1)
                    _ᖈᖈᖄᖙ(1487) === _ᖂᖀᖈᕷ[o][_ᖈᖈᖄᖙ(341)] ? i[_ᖀᕷᖂᖚ(160)](_ᖂᖀᖈᕷ[o]) : (s[_ᖀᕷᖂᖚ(160)](_ᖂᖀᖈᕷ[o]),
                    _ᖀᕷᖂᖚ(1424) === _ᖂᖀᖈᕷ[o][_ᖈᖈᖄᖙ(341)] && (r = _ᖂᖀᖈᕷ[o]));
                if (s[_ᖈᖈᖄᖙ(112)] >= _ᖄᖘᕺᖚ)
                    return [n][_ᖈᖈᖄᖙ(117)](s[_ᖀᕷᖂᖚ(119)](-(_ᖄᖘᕺᖚ - 1)));
                var _ᕾᖀᕸᕴ = _ᖄᖘᕺᖚ - s[_ᖈᖈᖄᖙ(112)] - 1
                    , _ᕵᖈᖆᖈ = [];
                if (r)
                    for (var c = 0; c < i[_ᖈᖈᖄᖙ(112)]; c += 1)
                        r[_ᖈᖈᖄᖙ(36)] - i[c][_ᖀᕷᖂᖚ(36)] <= this[_ᖈᖈᖄᖙ(517)][_ᖈᖈᖄᖙ(1445)] && _ᕵᖈᖆᖈ[_ᖈᖈᖄᖙ(160)](i[c]);
                for (var _ = _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(119)](-_ᕾᖀᕸᕴ), h = _ᕾᖀᕸᕴ - _[_ᖈᖈᖄᖙ(112)], l = i[_ᖀᕷᖂᖚ(112)] - 1; 0 < h && 0 <= l; l -= 1)
                    -1 === _[_ᖈᖈᖄᖙ(29)](i[l]) && (_[_ᖀᕷᖂᖚ(180)](i[l]),
                    h -= 1);
                return [n][_ᖈᖈᖄᖙ(117)](_, s)
            },
            $_BIDC: function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
                var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖀᕷᖂᖚ = ["$_FGJJh"].concat(_ᕵᕴᖆᖆ)
                    , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                _ᖀᕷᖂᖚ.shift();
                var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                if (!_ᖈᖈᖄᖙ)
                    return 0;
                var _ᕾᖀᕸᕴ = _ᖂᖀᖈᕷ / _ᖈᖈᖄᖙ
                    , _ᕵᖈᖆᖈ = Math[_ᖀᖚᖄᖙ(148)](10, this[_ᕵᕴᖆᖆ(517)][_ᖀᖚᖄᖙ(1402)]);
                return Math[_ᕵᕴᖆᖆ(692)](_ᕾᖀᕸᕴ * _ᕵᖈᖆᖈ) / _ᕵᖈᖆᖈ
            },
            $_BHHy: function(_ᖂᖀᖈᕷ) {
                var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᕵᕴᖆᖆ = ["$_FHAED"].concat(_ᖈᖈᖄᖙ)
                    , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                _ᕵᕴᖆᖆ.shift();
                var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                for (var t = [], n = 0; n < _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(112)]; n += 1) {
                    var s = _ᖂᖀᖈᕷ[n];
                    t[_ᖀᕷᖂᖚ(160)]([s[_ᖀᕷᖂᖚ(36)], this[_ᖀᕷᖂᖚ(1459)](s[_ᖀᕷᖂᖚ(163)], s[_ᖀᕷᖂᖚ(1477)]), this[_ᖈᖈᖄᖙ(1459)](s[_ᖀᕷᖂᖚ(154)], s[_ᖀᕷᖂᖚ(1451)]), _ᖀᖈᖂᖙ[s[_ᖈᖈᖄᖙ(341)]]])
                }
                return t
            },
            $Set: function(points){
                const _ = points.at(-1)
                this['points'] = points
                this.source = _['source']
                this.width = _['width']
                this.height = _['height']
                // 开始时间随便写，但结束时间必须是开始时间加最好一个轨迹的时间t
                // 滑块初始化的开始时间
                this.startTime = +new Date()
                // 滑块结束时间
                this.endTime = this.startTime + _['t']
                // 合并
                Object.assign(this, {"options": _ᕿᖗᖗᕵ})
                // 获取轨迹转换后的数据
                return this.getPayload()
            }
        };
        var _ᖗᕴᖄᖉ = _ᖄᕷᕴᖁ;
        _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(68)] = _ᖗᕴᖄᖉ
    },
    1: function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
        var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
            , _ᖀᖚᖄᖙ = ["$_FHAJj"].concat(_ᖀᕷᖂᖚ)
            , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
        _ᖀᖚᖄᖙ.shift();
        var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
        "use strict";
        _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(0)] = !0,
        _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(68)] = void 0;
        var _ᕵᖈᖆᖈ = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                , _ᖀᕷᖂᖚ = ["$_FHBEH"].concat(_ᕵᕴᖆᖆ)
                , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
            _ᖀᕷᖂᖚ.shift();
            var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
            return _ᖈᖈᖄᖙ && _ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(0)] ? _ᖈᖈᖄᖙ : {
                default: _ᖈᖈᖄᖙ
            }
        }(_ᕵᕴᖆᖆ(43));
        var _ᖀᖈᖂᖙ = null;
        function o() {
            var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_DQ()[8][14];
            for (; _ᖂᖀᖈᕷ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                switch (_ᖂᖀᖈᕷ) {
                case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                    return function _ᖂᖀᖈᕷ() {
                        var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᕵᕴᖆᖆ = ["$_FHBJY"].concat(_ᖈᖈᖄᖙ)
                            , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                        _ᕵᕴᖆᖆ.shift();
                        var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                        return _ᖀᕷᖂᖚ(8) != typeof Uint8Array && _ᖈᖈᖄᖙ(8) != typeof Uint16Array && _ᖀᕷᖂᖚ(8) != typeof Int32Array
                    }() ? (_ᖀᖈᖂᖙ || (_ᖀᖈᖂᖙ = _ᕵᕴᖆᖆ(44)),
                    _ᖀᖈᖂᖙ) : null;
                    break
                }
            }
        }
        function _ᕿᖄᖙᕴ(_ᖂᖀᖈᕷ) {
            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[4][12]; ) {
                switch (_ᖈᖈᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                    if (!_ᖂᖀᖈᕷ)
                        return null;
                    _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][13];
                    break;
                case _ᕺᖄᖃᖚ.$_DQ()[0][13]:
                    try {
                        var n = o();
                        return n ? (0,
                        _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(68)])(n[_ᖄᖘᕺᖚ(1481)](n[_ᖄᖘᕺᖚ(1479)](JSON[_ᖀᕷᖂᖚ(515)](_ᖂᖀᖈᕷ)))) : null
                    } catch (e) {
                        return null
                    }
                    _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[4][12];
                    break
                }
            }
        }
        _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(68)] = _ᕿᖄᖙᕴ
    },
    43:function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
        var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
            , _ᖀᖚᖄᖙ = ["$_FHCER"].concat(_ᖀᕷᖂᖚ)
            , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
        _ᖀᖚᖄᖙ.shift();
        var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
        "use strict";
        _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(0)] = !0,
        _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(68)] = void 0;
        var _ᕵᖈᖆᖈ = _ᖀᕷᖂᖚ(1492);
        function _ᖀᖈᖂᖙ(_ᖂᖀᖈᕷ) {
            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[4][12]; ) {
                switch (_ᖈᖈᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    for (var t = [], n = 0; n + 2 < _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(112)]; n += 3)
                        t[_ᖀᕷᖂᖚ(160)](_ᕵᖈᖆᖈ[_ᖂᖀᖈᕷ[n] >> 2]),
                        t[_ᖀᕷᖂᖚ(160)](_ᕵᖈᖆᖈ[(3 & _ᖂᖀᖈᕷ[n]) << 4 | _ᖂᖀᖈᕷ[n + 1] >> 4]),
                        t[_ᖄᖘᕺᖚ(160)](_ᕵᖈᖆᖈ[(15 & _ᖂᖀᖈᕷ[n + 1]) << 2 | _ᖂᖀᖈᕷ[n + 2] >> 6]),
                        t[_ᖀᕷᖂᖚ(160)](_ᕵᖈᖆᖈ[63 & _ᖂᖀᖈᕷ[n + 2]]);
                    _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[4][13];
                    break;
                case _ᕺᖄᖃᖚ.$_DQ()[0][13]:
                    return n < _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(112)] && (t[_ᖄᖘᕺᖚ(160)](_ᕵᖈᖆᖈ[_ᖂᖀᖈᕷ[n] >> 2]),
                    n + 1 < _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)] ? (t[_ᖄᖘᕺᖚ(160)](_ᕵᖈᖆᖈ[(3 & _ᖂᖀᖈᕷ[n]) << 4 | _ᖂᖀᖈᕷ[n + 1] >> 4]),
                    t[_ᖄᖘᕺᖚ(160)](_ᕵᖈᖆᖈ[(15 & _ᖂᖀᖈᕷ[n + 1]) << 2])) : t[_ᖄᖘᕺᖚ(160)](_ᕵᖈᖆᖈ[(3 & _ᖂᖀᖈᕷ[n]) << 4])),
                    t[_ᖄᖘᕺᖚ(165)](_ᖄᖘᕺᖚ(39));
                    break
                }
            }
        }
        _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(68)] = _ᖀᖈᖂᖙ
    },
    44:function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
        var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
            , _ᖀᖚᖄᖙ = ["$_FHCJh"].concat(_ᖀᕷᖂᖚ)
            , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
        _ᖀᖚᖄᖙ.shift();
        var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
        function d(_ᖂᖀᖈᕷ) {
            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᖈᖈᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                    return 10 + (_ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(1427)] ? _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(1427)][_ᖄᖘᕺᖚ(112)] + 1 : 0);
                    break
                }
            }
        }
        function f(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    var n = _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(1427)];
                    if (_ᖂᖀᖈᕷ[0] = 31,
                    _ᖂᖀᖈᕷ[1] = 139,
                    _ᖂᖀᖈᕷ[2] = 8,
                    _ᖂᖀᖈᕷ[8] = _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(1463)] < 2 ? 4 : 9 == _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(1463)] ? 2 : 0,
                    _ᖂᖀᖈᕷ[9] = 3,
                    0 != _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(1414)] && l(_ᖂᖀᖈᕷ, 4, Math[_ᖀᕷᖂᖚ(554)](new Date(_ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(1414)] || Date[_ᖀᕷᖂᖚ(121)]()) / 1e3)),
                    n) {
                        _ᖂᖀᖈᕷ[3] = 8;
                        for (var s = 0; s <= n[_ᖄᖘᕺᖚ(112)]; ++s)
                            _ᖂᖀᖈᕷ[s + 10] = n[_ᖀᕷᖂᖚ(185)](s)
                    }
                    _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[8][13];
                    break
                }
            }
        }
        function l(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᖀᕷᖂᖚ !== _ᕺᖄᖃᖚ.$_DQ()[8][13]; ) {
                switch (_ᖀᕷᖂᖚ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    for (; _ᕵᕴᖆᖆ; ++_ᖈᖈᖄᖙ)
                        _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ] = _ᕵᕴᖆᖆ,
                        _ᕵᕴᖆᖆ >>>= 8;
                    _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[0][13];
                    break
                }
            }
        }
        function h(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ, _ᖀᖚᖄᖙ, _ᕾᖀᕸᕴ) {
            var _ᕵᖈᖆᖈ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᕵᖈᖆᖈ !== _ᕺᖄᖃᖚ.$_DQ()[4][12]; ) {
                switch (_ᕵᖈᖆᖈ) {
                case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                    if (!_ᕾᖀᕸᕴ && (_ᕾᖀᕸᕴ = {
                        l: 1
                    },
                    _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(1450)])) {
                        var r = _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(1450)][_ᖄᖘᕺᖚ(1482)](-32768)
                            , o = new Z(r[_ᖀᕷᖂᖚ(112)] + _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)]);
                        o[_ᖀᕷᖂᖚ(1265)](r),
                        o[_ᖄᖘᕺᖚ(1265)](_ᖂᖀᖈᕷ, r[_ᖄᖘᕺᖚ(112)]),
                        _ᖂᖀᖈᕷ = o,
                        _ᕾᖀᕸᕴ[_ᖀᕷᖂᖚ(1088)] = r[_ᖀᕷᖂᖚ(112)]
                    }
                    _ᕵᖈᖆᖈ = _ᕺᖄᖃᖚ.$_DQ()[8][13];
                    break;
                case _ᕺᖄᖃᖚ.$_DQ()[0][13]:
                    return $_BDD(_ᖂᖀᖈᕷ, null == _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(1463)] ? 6 : _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(1463)], null == _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(1493)] ? _ᕾᖀᕸᕴ[_ᖄᖘᕺᖚ(82)] ? Math[_ᖀᕷᖂᖚ(574)](1.5 * Math[_ᖄᖘᕺᖚ(390)](8, Math[_ᖄᖘᕺᖚ(1096)](13, Math[_ᖀᕷᖂᖚ(588)](_ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)])))) : 20 : 12 + _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(1493)], _ᕵᕴᖆᖆ, _ᖀᖚᖄᖙ, _ᕾᖀᕸᕴ);
                    break
                }
            }
        }
        function _() {
            var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_DQ()[8][14];
            for (; _ᖂᖀᖈᕷ !== _ᕺᖄᖃᖚ.$_DQ()[4][12]; ) {
                switch (_ᖂᖀᖈᕷ) {
                case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                    var s = -1;
                    _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_DQ()[0][13];
                    break;
                case _ᕺᖄᖃᖚ.$_DQ()[0][13]:
                    return {
                        p: function(_ᖂᖀᖈᕷ) {
                            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_Cr
                                , _ᕵᕴᖆᖆ = ["$_FHDEk"].concat(_ᖈᖈᖄᖙ)
                                , _ᖀᕷᖂᖚ = _ᕵᕴᖆᖆ[1];
                            _ᕵᕴᖆᖆ.shift();
                            var _ᖀᖚᖄᖙ = _ᕵᕴᖆᖆ[0];
                            for (var t = s, n = 0; n < _ᖂᖀᖈᕷ[_ᖈᖈᖄᖙ(112)]; ++n)
                                t = c[255 & t ^ _ᖂᖀᖈᕷ[n]] ^ t >>> 8;
                            s = t
                        },
                        d: function() {
                            var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_Cr
                                , _ᖈᖈᖄᖙ = ["$_FHDJO"].concat(_ᖂᖀᖈᕷ)
                                , _ᕵᕴᖆᖆ = _ᖈᖈᖄᖙ[1];
                            _ᖈᖈᖄᖙ.shift();
                            var _ᖀᕷᖂᖚ = _ᖈᖈᖄᖙ[0];
                            return ~s
                        }
                    };
                    break
                }
            }
        }
        function $_BDD(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ, _ᖀᖚᖄᖙ, _ᕾᖀᕸᕴ, _ᕵᖈᖆᖈ) {
            var _ᖀᖈᖂᖙ = _ᕺᖄᖃᖚ.$_DQ()[8][14];
            for (; _ᖀᖈᖂᖙ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᖀᖈᖂᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    var o = _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(1011)] || _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)]
                        , a = new Z(_ᖀᖚᖄᖙ + o + 5 * (1 + Math[_ᖄᖘᕺᖚ(574)](o / 7e3)) + _ᕾᖀᕸᕴ)
                        , u = a[_ᖄᖘᕺᖚ(1482)](_ᖀᖚᖄᖙ, a[_ᖄᖘᕺᖚ(112)] - _ᕾᖀᕸᕴ)
                        , c = _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(82)]
                        , _ = 7 & (_ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(38)] || 0);
                    if (_ᖈᖈᖄᖙ) {
                        _ && (u[0] = _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(38)] >> 3);
                        for (var h = he[_ᖈᖈᖄᖙ - 1], l = h >> 13, p = 8191 & h, f = (1 << _ᕵᕴᖆᖆ) - 1, d = _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(92)] || new Y(32768), g = _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(629)] || new Y(1 + f), m = Math[_ᖄᖘᕺᖚ(574)](_ᕵᕴᖆᖆ / 3), v = 2 * m, b = function _ᖈᖈᖄᖙ(_ᕵᕴᖆᖆ) {
                            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
                                , _ᖀᖚᖄᖙ = ["$_FHEET"].concat(_ᖀᕷᖂᖚ)
                                , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
                            _ᖀᖚᖄᖙ.shift();
                            var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
                            return (_ᖂᖀᖈᕷ[_ᕵᕴᖆᖆ] ^ _ᖂᖀᖈᕷ[_ᕵᕴᖆᖆ + 1] << m ^ _ᖂᖀᖈᕷ[_ᕵᕴᖆᖆ + 2] << v) & f
                        }, w = new K(25e3), y = new Y(288), x = new Y(32), k = 0, T = 0, C = _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(1048)] || 0, E = 0, A = _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(1088)] || 0, B = 0; C + 2 < o; ++C) {
                            var S = b(C)
                                , D = 32767 & C
                                , z = g[S];
                            if (d[D] = z,
                            g[S] = D,
                            A <= C) {
                                var F = o - C;
                                if ((7e3 < k || 24576 < E) && (423 < F || !c)) {
                                    _ = $_BCS(_ᖂᖀᖈᕷ, u, 0, w, y, x, T, E, B, C - B, _),
                                    E = k = T = 0,
                                    B = C;
                                    for (var M = 0; M < 286; ++M)
                                        y[M] = 0;
                                    for (M = 0; M < 30; ++M)
                                        x[M] = 0
                                }
                                var O = 2
                                    , R = 0
                                    , I = p
                                    , P = D - z & 32767;
                                if (2 < F && S == b(C - P))
                                    for (var j = Math[_ᖀᕷᖂᖚ(1096)](l, F) - 1, N = Math[_ᖄᖘᕺᖚ(1096)](32767, C), L = Math[_ᖄᖘᕺᖚ(1096)](258, F); P <= N && --I && D != z; ) {
                                        if (_ᖂᖀᖈᕷ[C + O] == _ᖂᖀᖈᕷ[C + O - P]) {
                                            for (var q = 0; q < L && _ᖂᖀᖈᕷ[C + q] == _ᖂᖀᖈᕷ[C + q - P]; ++q)
                                                ;
                                            if (O < q) {
                                                if (R = P,
                                                j < (O = q))
                                                    break;
                                                var $ = Math[_ᖄᖘᕺᖚ(1096)](P, q - 2)
                                                    , H = 0;
                                                for (M = 0; M < $; ++M) {
                                                    var V = C - P + M & 32767
                                                        , U = V - d[V] & 32767;
                                                    H < U && (H = U,
                                                    z = V)
                                                }
                                            }
                                        }
                                        P += (D = z) - (z = d[D]) & 32767
                                    }
                                if (R) {
                                    w[E++] = 268435456 | ee[O] << 18 | te[R];
                                    var X = 31 & ee[O]
                                        , G = 31 & te[R];
                                    T += Q[X] + J[G],
                                    ++y[257 + X],
                                    ++x[G],
                                    A = C + O,
                                    ++k
                                } else
                                    w[E++] = _ᖂᖀᖈᕷ[C],
                                    ++y[_ᖂᖀᖈᕷ[C]]
                            }
                        }
                        for (C = Math[_ᖄᖘᕺᖚ(390)](C, A); C < o; ++C)
                            w[E++] = _ᖂᖀᖈᕷ[C],
                            ++y[_ᖂᖀᖈᕷ[C]];
                        _ = $_BCS(_ᖂᖀᖈᕷ, u, c, w, y, x, T, E, B, C - B, _),
                        c || (_ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(38)] = 7 & _ | u[_ / 8 | 0] << 3,
                        _ -= 7,
                        _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(629)] = g,
                        _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(92)] = d,
                        _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(1048)] = C,
                        _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(1088)] = A)
                    } else {
                        for (C = _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(1088)] || 0; C < o + c; C += 65535) {
                            var W = C + 65535;
                            o <= W && (u[_ / 8 | 0] = c,
                            W = o),
                            _ = $_BBC(u, _ + 1, _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(1482)](C, W))
                        }
                        _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(1048)] = o
                    }
                    return $_FR(a, 0, _ᖀᖚᖄᖙ + $_Eu(_) + _ᕾᖀᕸᕴ);
                    break
                }
            }
        }
        function $_BCS(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ, _ᖀᖚᖄᖙ, _ᕾᖀᕸᕴ, _ᕵᖈᖆᖈ, _ᖀᖈᖂᖙ, _ᕿᖄᖙᕴ, _ᕿᖗᖗᕵ, _ᖄᕷᕴᖁ, _ᖗᕴᖄᖉ) {
            var _ᖄᖄᖗᖈ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᖄᖄᖗᖈ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                switch (_ᖄᖄᖗᖈ) {
                case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                    $_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ++, _ᕵᕴᖆᖆ),
                    ++_ᕾᖀᕸᕴ[256];
                    for (var h = $_IO(_ᕾᖀᕸᕴ, 15), l = h[_ᖀᕷᖂᖚ(36)], p = h[_ᖀᕷᖂᖚ(82)], f = $_IO(_ᕵᖈᖆᖈ, 15), d = f[_ᖀᕷᖂᖚ(36)], g = f[_ᖀᕷᖂᖚ(82)], m = $_Jb(l), v = m[_ᖀᕷᖂᖚ(73)], b = m[_ᖄᖘᕺᖚ(80)], w = $_Jb(d), y = w[_ᖄᖘᕺᖚ(73)], x = w[_ᖀᕷᖂᖚ(80)], k = new Y(19), T = 0; T < v[_ᖄᖘᕺᖚ(112)]; ++T)
                        ++k[31 & v[T]];
                    for (T = 0; T < y[_ᖀᕷᖂᖚ(112)]; ++T)
                        ++k[31 & y[T]];
                    for (var C = $_IO(k, 7), E = C[_ᖀᕷᖂᖚ(36)], A = C[_ᖀᕷᖂᖚ(82)], B = 19; 4 < B && !E[H[B - 1]]; --B)
                        ;
                    var S, D, z, F, M = _ᖄᕷᕴᖁ + 5 << 3, O = $_BAs(_ᕾᖀᕸᕴ, U) + $_BAs(_ᕵᖈᖆᖈ, X) + _ᖀᖈᖂᖙ, R = $_BAs(_ᕾᖀᕸᕴ, l) + $_BAs(_ᕵᖈᖆᖈ, d) + _ᖀᖈᖂᖙ + 14 + 3 * B + $_BAs(k, E) + 2 * k[16] + 3 * k[17] + 7 * k[18];
                    if (0 <= _ᕿᖗᖗᕵ && M <= O && M <= R)
                        return $_BBC(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(1482)](_ᕿᖗᖗᕵ, _ᕿᖗᖗᕵ + _ᖄᕷᕴᖁ));
                    if ($_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, 1 + (R < O)),
                    _ᖗᕴᖄᖉ += 2,
                    R < O) {
                        S = V(l, p, 0),
                        D = l,
                        z = V(d, g, 0),
                        F = d;
                        var I = V(E, A, 0);
                        $_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, b - 257),
                        $_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ + 5, x - 1),
                        $_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ + 10, B - 4),
                        _ᖗᕴᖄᖉ += 14;
                        for (T = 0; T < B; ++T)
                            $_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ + 3 * T, E[H[T]]);
                        _ᖗᕴᖄᖉ += 3 * B;
                        for (var P = [v, y], j = 0; j < 2; ++j) {
                            var N = P[j];
                            for (T = 0; T < N[_ᖀᕷᖂᖚ(112)]; ++T) {
                                var L = 31 & N[T];
                                $_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, I[L]),
                                _ᖗᕴᖄᖉ += E[L],
                                15 < L && ($_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, N[T] >> 5 & 127),
                                _ᖗᕴᖄᖉ += N[T] >> 12)
                            }
                        }
                    } else
                        S = G,
                        D = U,
                        z = W,
                        F = X;
                    for (T = 0; T < _ᕿᖄᖙᕴ; ++T) {
                        var q = _ᖀᖚᖄᖙ[T];
                        if (255 < q) {
                            $_Hr(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, S[(L = q >> 18 & 31) + 257]),
                            _ᖗᕴᖄᖉ += D[L + 257],
                            7 < L && ($_GU(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, q >> 23 & 31),
                            _ᖗᕴᖄᖉ += Q[L]);
                            var $ = 31 & q;
                            $_Hr(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, z[$]),
                            _ᖗᕴᖄᖉ += F[$],
                            3 < $ && ($_Hr(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, q >> 5 & 8191),
                            _ᖗᕴᖄᖉ += J[$])
                        } else
                            $_Hr(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, S[q]),
                            _ᖗᕴᖄᖉ += D[q]
                    }
                    return $_Hr(_ᖈᖈᖄᖙ, _ᖗᕴᖄᖉ, S[256]),
                    _ᖗᕴᖄᖉ + D[256];
                    break
                }
            }
        }
        function $_BBC(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖀᕷᖂᖚ !== _ᕺᖄᖃᖚ.$_DQ()[8][13]; ) {
                switch (_ᖀᕷᖂᖚ) {
                case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                    var s = _ᕵᕴᖆᖆ[_ᖄᖘᕺᖚ(112)]
                        , i = $_Eu(_ᖈᖈᖄᖙ + 2);
                    _ᖂᖀᖈᕷ[i] = 255 & s,
                    _ᖂᖀᖈᕷ[i + 1] = s >> 8,
                    _ᖂᖀᖈᕷ[i + 2] = 255 ^ _ᖂᖀᖈᕷ[i],
                    _ᖂᖀᖈᕷ[i + 3] = 255 ^ _ᖂᖀᖈᕷ[i + 1];
                    for (var r = 0; r < s; ++r)
                        _ᖂᖀᖈᕷ[i + r + 4] = _ᕵᕴᖆᖆ[r];
                    return 8 * (i + 4 + s);
                    break
                }
            }
        }
        function $_BAs(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[8][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                    for (var n = 0, s = 0; s < _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(112)]; ++s)
                        n += _ᖂᖀᖈᕷ[s] * _ᖈᖈᖄᖙ[s];
                    return n;
                    break
                }
            }
        }
        function $_Jb(_ᖂᖀᖈᕷ) {
            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[8][12]; ) {
                switch (_ᖈᖈᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    for (var t = _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)]; t && !_ᖂᖀᖈᕷ[--t]; )
                        ;
                    for (var n = new Y(++t), s = 0, i = _ᖂᖀᖈᕷ[0], r = 1, o = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                        var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᖀᕷᖂᖚ = ["$_FHEJp"].concat(_ᕵᕴᖆᖆ)
                            , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                        _ᖀᕷᖂᖚ.shift();
                        var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                        n[s++] = _ᖈᖈᖄᖙ
                    }, a = 1; a <= t; ++a)
                        if (_ᖂᖀᖈᕷ[a] == i && a != t)
                            ++r;
                        else {
                            if (!i && 2 < r) {
                                for (; 138 < r; r -= 138)
                                    o(32754);
                                2 < r && (o(10 < r ? r - 11 << 5 | 28690 : r - 3 << 5 | 12305),
                                r = 0)
                            } else if (3 < r) {
                                for (o(i),
                                --r; 6 < r; r -= 6)
                                    o(8304);
                                2 < r && (o(r - 3 << 5 | 8208),
                                r = 0)
                            }
                            for (; r--; )
                                o(i);
                            r = 1,
                            i = _ᖂᖀᖈᕷ[a]
                        }
                    _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[4][13];
                    break;
                case _ᕺᖄᖃᖚ.$_DQ()[8][13]:
                    return {
                        c: n[_ᖄᖘᕺᖚ(1482)](0, s),
                        n: t
                    };
                    break
                }
            }
        }
        function y(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᖚᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[0][14];
            for (; _ᖀᖚᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᖀᖚᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    return -1 == _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(41)] ? Math[_ᖄᖘᕺᖚ(390)](y(_ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(82)], _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ + 1), y(_ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(38)], _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ + 1)) : _ᖈᖈᖄᖙ[_ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(41)]] = _ᕵᕴᖆᖆ;
                    break
                }
            }
        }
        function $_IO(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    for (var n = [], s = 0; s < _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)]; ++s)
                        _ᖂᖀᖈᕷ[s] && n[_ᖀᕷᖂᖚ(160)]({
                            s: s,
                            f: _ᖂᖀᖈᕷ[s]
                        });
                    var i = n[_ᖀᕷᖂᖚ(112)]
                        , r = n[_ᖄᖘᕺᖚ(119)]();
                    if (!i)
                        return {
                            t: x,
                            l: 0
                        };
                    if (1 == i) {
                        var o = new Z(n[0][_ᖀᕷᖂᖚ(41)] + 1);
                        return o[n[0][_ᖄᖘᕺᖚ(41)]] = 1,
                        {
                            t: o,
                            l: 1
                        }
                    }
                    n[_ᖄᖘᕺᖚ(1440)](function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
                        var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                            , _ᖀᕷᖂᖚ = ["$_FHFEd"].concat(_ᕵᕴᖆᖆ)
                            , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                        _ᖀᕷᖂᖚ.shift();
                        var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                        return _ᖂᖀᖈᕷ[_ᕵᕴᖆᖆ(1041)] - _ᖈᖈᖄᖙ[_ᖀᖚᖄᖙ(1041)]
                    }),
                    n[_ᖄᖘᕺᖚ(160)]({
                        s: -1,
                        f: 25001
                    });
                    var a = n[0]
                        , u = n[1]
                        , c = 0
                        , _ = 1
                        , h = 2;
                    for (n[0] = {
                        s: -1,
                        f: a[_ᖄᖘᕺᖚ(1041)] + u[_ᖀᕷᖂᖚ(1041)],
                        l: a,
                        r: u
                    }; _ != i - 1; )
                        a = n[n[c][_ᖄᖘᕺᖚ(1041)] < n[h][_ᖀᕷᖂᖚ(1041)] ? c++ : h++],
                        u = n[c != _ && n[c][_ᖀᕷᖂᖚ(1041)] < n[h][_ᖄᖘᕺᖚ(1041)] ? c++ : h++],
                        n[_++] = {
                            s: -1,
                            f: a[_ᖀᕷᖂᖚ(1041)] + u[_ᖀᕷᖂᖚ(1041)],
                            l: a,
                            r: u
                        };
                    var l = r[0][_ᖄᖘᕺᖚ(41)];
                    for (s = 1; s < i; ++s)
                        r[s][_ᖀᕷᖂᖚ(41)] > l && (l = r[s][_ᖄᖘᕺᖚ(41)]);
                    var p = new Y(l + 1)
                        , f = y(n[_ - 1], p, 0);
                    if (_ᖈᖈᖄᖙ < f) {
                        s = 0;
                        var d = 0
                            , g = f - _ᖈᖈᖄᖙ
                            , m = 1 << g;
                        for (r[_ᖀᕷᖂᖚ(1440)](function(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
                            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                                , _ᖀᕷᖂᖚ = ["$_FHFJw"].concat(_ᕵᕴᖆᖆ)
                                , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                            _ᖀᕷᖂᖚ.shift();
                            var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                            return p[_ᖈᖈᖄᖙ[_ᕵᕴᖆᖆ(41)]] - p[_ᖂᖀᖈᕷ[_ᕵᕴᖆᖆ(41)]] || _ᖂᖀᖈᕷ[_ᖀᖚᖄᖙ(1041)] - _ᖈᖈᖄᖙ[_ᖀᖚᖄᖙ(1041)]
                        }); s < i; ++s) {
                            var v = r[s][_ᖄᖘᕺᖚ(41)];
                            if (!(p[v] > _ᖈᖈᖄᖙ))
                                break;
                            d += m - (1 << f - p[v]),
                            p[v] = _ᖈᖈᖄᖙ
                        }
                        for (d >>= g; 0 < d; ) {
                            var b = r[s][_ᖀᕷᖂᖚ(41)];
                            p[b] < _ᖈᖈᖄᖙ ? d -= 1 << _ᖈᖈᖄᖙ - p[b]++ - 1 : ++s
                        }
                        for (; 0 <= s && d; --s) {
                            var w = r[s][_ᖀᕷᖂᖚ(41)];
                            p[w] == _ᖈᖈᖄᖙ && (--p[w],
                            ++d)
                        }
                        f = _ᖈᖈᖄᖙ
                    }
                    return {
                        t: new Z(p),
                        l: f
                    };
                    break
                }
            }
        }
        function $_Hr(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖀᕷᖂᖚ !== _ᕺᖄᖃᖚ.$_DQ()[8][13]; ) {
                switch (_ᖀᕷᖂᖚ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    _ᕵᕴᖆᖆ <<= 7 & _ᖈᖈᖄᖙ;
                    var s = _ᖈᖈᖄᖙ / 8 | 0;
                    _ᖂᖀᖈᕷ[s] |= _ᕵᕴᖆᖆ,
                    _ᖂᖀᖈᕷ[1 + s] |= _ᕵᕴᖆᖆ >> 8,
                    _ᖂᖀᖈᕷ[2 + s] |= _ᕵᕴᖆᖆ >> 16;
                    _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[0][13];
                    break
                }
            }
        }
        function $_GU(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖀᕷᖂᖚ !== _ᕺᖄᖃᖚ.$_DQ()[8][13]; ) {
                switch (_ᖀᕷᖂᖚ) {
                case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                    _ᕵᕴᖆᖆ <<= 7 & _ᖈᖈᖄᖙ;
                    var s = _ᖈᖈᖄᖙ / 8 | 0;
                    _ᖂᖀᖈᕷ[s] |= _ᕵᕴᖆᖆ,
                    _ᖂᖀᖈᕷ[1 + s] |= _ᕵᕴᖆᖆ >> 8;
                    _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[8][13];
                    break
                }
            }
        }
        function $_FR(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᖚᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖀᖚᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[8][13]; ) {
                switch (_ᖀᖚᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                    return (null == _ᖈᖈᖄᖙ || _ᖈᖈᖄᖙ < 0) && (_ᖈᖈᖄᖙ = 0),
                    (null == _ᕵᕴᖆᖆ || _ᕵᕴᖆᖆ > _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(112)]) && (_ᕵᕴᖆᖆ = _ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(112)]),
                    new Z(_ᖂᖀᖈᕷ[_ᖀᕷᖂᖚ(1482)](_ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ));
                    break
                }
            }
        }
        function $_Eu(_ᖂᖀᖈᕷ) {
            var _ᖈᖈᖄᖙ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖈᖈᖄᖙ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᖈᖈᖄᖙ) {
                case _ᕺᖄᖃᖚ.$_DQ()[4][14]:
                    return (_ᖂᖀᖈᕷ + 7) / 8 | 0;
                    break
                }
            }
        }
        function V(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᖀᕷᖂᖚ !== _ᕺᖄᖃᖚ.$_DQ()[4][13]; ) {
                switch (_ᖀᕷᖂᖚ) {
                case _ᕺᖄᖃᖚ.$_DQ()[0][14]:
                    for (var s = _ᖂᖀᖈᕷ[_ᖄᖘᕺᖚ(112)], i = 0, r = new Y(_ᖈᖈᖄᖙ); i < s; ++i)
                        _ᖂᖀᖈᕷ[i] && ++r[_ᖂᖀᖈᕷ[i] - 1];
                    var o, a = new Y(_ᖈᖈᖄᖙ);
                    for (i = 1; i < _ᖈᖈᖄᖙ; ++i)
                        a[i] = a[i - 1] + r[i - 1] << 1;
                    if (_ᕵᕴᖆᖆ) {
                        o = new Y(1 << _ᖈᖈᖄᖙ);
                        var u = 15 - _ᖈᖈᖄᖙ;
                        for (i = 0; i < s; ++i)
                            if (_ᖂᖀᖈᕷ[i])
                                for (var c = i << 4 | _ᖂᖀᖈᕷ[i], _ = _ᖈᖈᖄᖙ - _ᖂᖀᖈᕷ[i], h = a[_ᖂᖀᖈᕷ[i] - 1]++ << _, l = h | (1 << _) - 1; h <= l; ++h)
                                    o[p[h] >> u] = c
                    } else
                        for (o = new Y(s),
                        i = 0; i < s; ++i)
                            _ᖂᖀᖈᕷ[i] && (o[i] = p[a[_ᖂᖀᖈᕷ[i] - 1]++] >> 15 - _ᖂᖀᖈᕷ[i]);
                    return o;
                    break
                }
            }
        }
        function o(_ᖂᖀᖈᕷ, _ᖈᖈᖄᖙ) {
            var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_DQ()[4][14];
            for (; _ᕵᕴᖆᖆ !== _ᕺᖄᖃᖚ.$_DQ()[0][13]; ) {
                switch (_ᕵᕴᖆᖆ) {
                case _ᕺᖄᖃᖚ.$_DQ()[8][14]:
                    for (var n = new Y(31), s = 0; s < 31; ++s)
                        n[s] = _ᖈᖈᖄᖙ += 1 << _ᖂᖀᖈᕷ[s - 1];
                    var i = new K(n[30]);
                    for (s = 1; s < 30; ++s)
                        for (var r = n[s]; r < n[s + 1]; ++r)
                            i[r] = r - n[s] << 5 | s;
                    return {
                        b: n,
                        r: i
                    };
                    break
                }
            }
        }
        "use strict";
        _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(0)] = !0,
        _ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(1481)] = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
                , _ᖀᖚᖄᖙ = ["$_FHGEh"].concat(_ᖀᕷᖂᖚ)
                , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
            _ᖀᖚᖄᖙ.shift();
            var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
            _ᕵᕴᖆᖆ || (_ᕵᕴᖆᖆ = {});
            var _ᕵᖈᖆᖈ = _()
                , _ᖀᖈᖂᖙ = _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(112)];
            _ᕵᖈᖆᖈ[_ᖄᖘᕺᖚ(92)](_ᖈᖈᖄᖙ);
            var _ᕿᖄᖙᕴ = h(_ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ, d(_ᕵᕴᖆᖆ), 8)
                , _ᕿᖗᖗᕵ = _ᕿᖄᖙᕴ[_ᖄᖘᕺᖚ(112)];
            return f(_ᕿᖄᖙᕴ, _ᕵᕴᖆᖆ),
            l(_ᕿᖄᖙᕴ, _ᕿᖗᖗᕵ - 8, _ᕵᖈᖆᖈ[_ᖀᕷᖂᖚ(12)]()),
            l(_ᕿᖄᖙᕴ, _ᕿᖗᖗᕵ - 4, _ᖀᖈᖂᖙ),
            _ᕿᖄᖙᕴ
        }
        ,
        _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(1479)] = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ, _ᕵᕴᖆᖆ) {
            var _ᖀᕷᖂᖚ = _ᕺᖄᖃᖚ.$_Cr
                , _ᖀᖚᖄᖙ = ["$_FHGJV"].concat(_ᖀᕷᖂᖚ)
                , _ᖄᖘᕺᖚ = _ᖀᖚᖄᖙ[1];
            _ᖀᖚᖄᖙ.shift();
            var _ᕾᖀᕸᕴ = _ᖀᖚᖄᖙ[0];
            if (_ᕵᕴᖆᖆ) {
                for (var n = new Z(_ᖈᖈᖄᖙ[_ᖀᕷᖂᖚ(112)]), s = 0; s < _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(112)]; ++s)
                    n[s] = _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(185)](s);
                return n
            }
            if (g)
                return g[_ᖀᕷᖂᖚ(576)](_ᖈᖈᖄᖙ);
            for (var i = _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(112)], r = new Z(_ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(112)] + (_ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(112)] >> 1)), o = 0, a = function _ᖂᖀᖈᕷ(_ᖈᖈᖄᖙ) {
                var _ᕵᕴᖆᖆ = _ᕺᖄᖃᖚ.$_Cr
                    , _ᖀᕷᖂᖚ = ["$_FHHEV"].concat(_ᕵᕴᖆᖆ)
                    , _ᖀᖚᖄᖙ = _ᖀᕷᖂᖚ[1];
                _ᖀᕷᖂᖚ.shift();
                var _ᖄᖘᕺᖚ = _ᖀᕷᖂᖚ[0];
                r[o++] = _ᖈᖈᖄᖙ
            }, s = 0; s < i; ++s) {
                if (o + 5 > r[_ᖀᕷᖂᖚ(112)]) {
                    var u = new Z(o + 8 + (i - s << 1));
                    u[_ᖀᕷᖂᖚ(1265)](r),
                    r = u
                }
                var c = _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(185)](s);
                c < 128 || _ᕵᕴᖆᖆ ? a(c) : (c < 2048 ? a(192 | c >> 6) : (55295 < c && c < 57344 ? (c = 65536 + (1047552 & c) | 1023 & _ᖈᖈᖄᖙ[_ᖄᖘᕺᖚ(185)](++s),
                a(240 | c >> 18),
                a(128 | c >> 12 & 63)) : a(224 | c >> 12),
                a(128 | c >> 6 & 63)),
                a(128 | 63 & c))
            }
            return $_FR(r, 0, o)
        }
        ;
        var Z = Uint8Array
            , Y = Uint16Array
            , K = Int32Array
            , Q = new Z([0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 0, 0, 0, 0])
            , J = new Z([0, 0, 0, 0, 1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 0, 0])
            , H = new Z([16, 17, 18, 0, 8, 7, 9, 6, 10, 5, 11, 4, 12, 3, 13, 2, 14, 1, 15])
            , s = o(Q, 2)
            , i = s[_ᖀᕷᖂᖚ(1075)]
            , ee = s[_ᖄᖘᕺᖚ(38)];
        i[28] = 258,
        ee[258] = 28;
        var r = o(J, 0)
            , te = (r[_ᖄᖘᕺᖚ(1075)],
        r[_ᖀᕷᖂᖚ(38)])
            , p = new Y(32768);
        for (u = 0; u < 32768; ++u)
            a = (61680 & (a = (52428 & (a = (43690 & u) >> 1 | (21845 & u) << 1)) >> 2 | (13107 & a) << 2)) >> 4 | (3855 & a) << 4,
            p[u] = ((65280 & a) >> 8 | (255 & a) << 8) >> 1;
        var a, U = new Z(288);
        for (u = 0; u < 144; ++u)
            U[u] = 8;
        for (u = 144; u < 256; ++u)
            U[u] = 9;
        for (u = 256; u < 280; ++u)
            U[u] = 7;
        for (u = 280; u < 288; ++u)
            U[u] = 8;
        var X = new Z(32);
        for (u = 0; u < 32; ++u)
            X[u] = 5;
        var u, G = V(U, 9, 0), W = V(X, 5, 0), he = new K([65540, 131080, 131088, 131104, 262176, 1048704, 1048832, 2114560, 2117632]), x = new Z(0), c = function() {
            var _ᖂᖀᖈᕷ = _ᕺᖄᖃᖚ.$_Cr
                , _ᖈᖈᖄᖙ = ["$_FHHJP"].concat(_ᖂᖀᖈᕷ)
                , _ᕵᕴᖆᖆ = _ᖈᖈᖄᖙ[1];
            _ᖈᖈᖄᖙ.shift();
            var _ᖀᕷᖂᖚ = _ᖈᖈᖄᖙ[0];
            for (var e = new Int32Array(256), t = 0; t < 256; ++t) {
                for (var n = t, s = 9; --s; )
                    n = (1 & n && -306674912) ^ n >>> 1;
                e[t] = n
            }
            return e
        }();
        var g = _ᖄᖘᕺᖚ(8) != typeof TextEncoder && new TextEncoder
            , m = _ᖀᕷᖂᖚ(8) != typeof TextDecoder && new TextDecoder;
        try {
            m[_ᖄᖘᕺᖚ(529)](x, {
                stream: !0
            }),
            1
        } catch (w) {}
    }
});

// 轨迹转换处理
t = jzq(0)
// 轨迹加密处理
j = jzq(1)


/*
逆向可测试网站地址 https://www.ui07nxj.com/login
版本：version 1.9.7
参数位数：无固定
执行环境：Node / 浏览器
补环境：无须补环境
扣代码的日期：2026-10-03
代码更新日期：2026-10-10
*/

// 轨迹，先写死...
const points =[{"x":301,"y":100,"width":301.79168701171875,"height":261.13543701171875,"t":0,"type":"start","source":1,"pressure":0},{"x":289,"y":103,"width":301.79168701171875,"height":261.13543701171875,"t":17,"type":"move","source":1,"pressure":0},{"x":281,"y":106,"width":301.79168701171875,"height":261.13543701171875,"t":34,"type":"move","source":1,"pressure":0},{"x":267,"y":108,"width":301.79168701171875,"height":261.13543701171875,"t":51,"type":"move","source":1,"pressure":0},{"x":252,"y":110,"width":301.79168701171875,"height":261.13543701171875,"t":69,"type":"move","source":1,"pressure":0},{"x":243,"y":111,"width":301.79168701171875,"height":261.13543701171875,"t":88,"type":"move","source":1,"pressure":0},{"x":243,"y":108,"width":301.79168701171875,"height":261.13543701171875,"t":162,"type":"move","source":1,"pressure":0},{"x":242,"y":106,"width":301.79168701171875,"height":261.13543701171875,"t":212,"type":"move","source":1,"pressure":0},{"x":241,"y":104,"width":301.79168701171875,"height":261.13543701171875,"t":231,"type":"move","source":1,"pressure":0},{"x":241,"y":102,"width":301.79168701171875,"height":261.13543701171875,"t":257,"type":"move","source":1,"pressure":0}]

// 轨迹转换处理，$Set 是自写方法
const trajectory_processing = t.default.prototype.$Set(points)
console.log("轨迹二次处理后 -> ", JSON.stringify(trajectory_processing))
// 轨迹加密
console.log("td参数 -> ", j.default(trajectory_processing))

